taskt/Core/Automation/Commands/DictionaryGroup/IDictionaryProperties_[%reverse%].dot
digraph "taskt.Core.Automation.Commands.IDictionaryProperties" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.ADictionaryInputDictionaryCommands" [ label="ADictionaryInputDictionaryCommands", style="dashed", ];
"taskt.Core.Automation.Commands.IDictionaryProperties" [ label="IDictionaryProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IDictionaryAddCreateProperties" [ label="IDictionaryAddCreateProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IDictionaryKeyProperties" [ label="IDictionaryKeyProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.ADictionaryAddCreateCommands" [ label="ADictionaryAddCreateCommands", style="dashed", ];
"taskt.Core.Automation.Commands.ADictionaryGetFromDictionaryCommands" [ label="ADictionaryGetFromDictionaryCommands", style="dashed", ];
"taskt.Core.Automation.Commands.ADictionaryKeyCommands" [ label="ADictionaryKeyCommands", style="dashed", ];
"taskt.Core.Automation.Commands.ExportDictionaryAsTextFileCommand" [ label="ExportDictionaryAsTextFileCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.BeginLoopForDictionaryCommand" [ label="BeginLoopForDictionaryCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ReplaceDictionaryCommand" [ label="ReplaceDictionaryCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.IDictionaryKeyActionProperties" [ label="IDictionaryKeyActionProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.AddDictionaryItemCommand" [ label="AddDictionaryItemCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.CreateDictionaryCommand" [ label="CreateDictionaryCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ConvertDictionaryToVisualizedTextCommand" [ label="ConvertDictionaryToVisualizedTextCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ConvertDictionaryToTextCommand" [ label="ConvertDictionaryToTextCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.JoinDictionaryValuesAsTextCommand" [ label="JoinDictionaryValuesAsTextCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ConvertDictionaryToDataTableCommand" [ label="ConvertDictionaryToDataTableCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ConvertDictionaryToListCommand" [ label="ConvertDictionaryToListCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ConvertDictionaryToJSONCommand" [ label="ConvertDictionaryToJSONCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetDictionaryKeysListCommand" [ label="GetDictionaryKeysListCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetDictionaryKeyFromValueCommand" [ label="GetDictionaryKeyFromValueCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ADictionaryKeyActionCommands" [ label="ADictionaryKeyActionCommands", style="dashed", ];
"taskt.Core.Automation.Commands.CheckDictionaryKeyExistsCommand" [ label="CheckDictionaryKeyExistsCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.RemoveDictionaryItemCommand" [ label="RemoveDictionaryItemCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SetDictionaryValueCommand" [ label="SetDictionaryValueCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetDictionaryValueCommand" [ label="GetDictionaryValueCommand", shape="parallelogram", style="bold", ];

"taskt.Core.Automation.Commands.ADictionaryInputDictionaryCommands" -> "taskt.Core.Automation.Commands.IDictionaryProperties";
"taskt.Core.Automation.Commands.IDictionaryAddCreateProperties" -> "taskt.Core.Automation.Commands.IDictionaryProperties";
"taskt.Core.Automation.Commands.IDictionaryKeyProperties" -> "taskt.Core.Automation.Commands.IDictionaryProperties";
"taskt.Core.Automation.Commands.ADictionaryAddCreateCommands" -> "taskt.Core.Automation.Commands.ADictionaryInputDictionaryCommands";
"taskt.Core.Automation.Commands.ADictionaryGetFromDictionaryCommands" -> "taskt.Core.Automation.Commands.ADictionaryInputDictionaryCommands";
"taskt.Core.Automation.Commands.ADictionaryKeyCommands" -> "taskt.Core.Automation.Commands.ADictionaryInputDictionaryCommands";
"taskt.Core.Automation.Commands.ExportDictionaryAsTextFileCommand" -> "taskt.Core.Automation.Commands.ADictionaryInputDictionaryCommands";
"taskt.Core.Automation.Commands.BeginLoopForDictionaryCommand" -> "taskt.Core.Automation.Commands.ADictionaryInputDictionaryCommands";
"taskt.Core.Automation.Commands.ReplaceDictionaryCommand" -> "taskt.Core.Automation.Commands.ADictionaryInputDictionaryCommands";
"taskt.Core.Automation.Commands.ADictionaryAddCreateCommands" -> "taskt.Core.Automation.Commands.IDictionaryAddCreateProperties";
"taskt.Core.Automation.Commands.ADictionaryKeyCommands" -> "taskt.Core.Automation.Commands.IDictionaryKeyProperties";
"taskt.Core.Automation.Commands.IDictionaryKeyActionProperties" -> "taskt.Core.Automation.Commands.IDictionaryKeyProperties";
"taskt.Core.Automation.Commands.AddDictionaryItemCommand" -> "taskt.Core.Automation.Commands.ADictionaryAddCreateCommands";
"taskt.Core.Automation.Commands.CreateDictionaryCommand" -> "taskt.Core.Automation.Commands.ADictionaryAddCreateCommands";
"taskt.Core.Automation.Commands.ConvertDictionaryToVisualizedTextCommand" -> "taskt.Core.Automation.Commands.ADictionaryGetFromDictionaryCommands";
"taskt.Core.Automation.Commands.ConvertDictionaryToTextCommand" -> "taskt.Core.Automation.Commands.ADictionaryGetFromDictionaryCommands";
"taskt.Core.Automation.Commands.JoinDictionaryValuesAsTextCommand" -> "taskt.Core.Automation.Commands.ADictionaryGetFromDictionaryCommands";
"taskt.Core.Automation.Commands.ConvertDictionaryToDataTableCommand" -> "taskt.Core.Automation.Commands.ADictionaryGetFromDictionaryCommands";
"taskt.Core.Automation.Commands.ConvertDictionaryToListCommand" -> "taskt.Core.Automation.Commands.ADictionaryGetFromDictionaryCommands";
"taskt.Core.Automation.Commands.ConvertDictionaryToJSONCommand" -> "taskt.Core.Automation.Commands.ADictionaryGetFromDictionaryCommands";
"taskt.Core.Automation.Commands.GetDictionaryKeysListCommand" -> "taskt.Core.Automation.Commands.ADictionaryGetFromDictionaryCommands";
"taskt.Core.Automation.Commands.GetDictionaryKeyFromValueCommand" -> "taskt.Core.Automation.Commands.ADictionaryGetFromDictionaryCommands";
"taskt.Core.Automation.Commands.ADictionaryKeyActionCommands" -> "taskt.Core.Automation.Commands.ADictionaryKeyCommands";
"taskt.Core.Automation.Commands.CheckDictionaryKeyExistsCommand" -> "taskt.Core.Automation.Commands.ADictionaryKeyCommands";
"taskt.Core.Automation.Commands.ADictionaryKeyActionCommands" -> "taskt.Core.Automation.Commands.IDictionaryKeyActionProperties";
"taskt.Core.Automation.Commands.RemoveDictionaryItemCommand" -> "taskt.Core.Automation.Commands.ADictionaryKeyActionCommands";
"taskt.Core.Automation.Commands.SetDictionaryValueCommand" -> "taskt.Core.Automation.Commands.ADictionaryKeyActionCommands";
"taskt.Core.Automation.Commands.GetDictionaryValueCommand" -> "taskt.Core.Automation.Commands.ADictionaryKeyActionCommands";
}
